In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("sample_data.csv")

In [11]:
df.head()

   id first_name last_name                         email  gender
0   1   Fidelity    Lincey  flincey0@theglobeandmail.com  Female
1   2      Rheta   Yurasov        ryurasov1@linkedin.com  Female
2   3     Bendix    Paszak             bpaszak2@imdb.com    Male
3   4        Cly    Cossar             ccossar3@1und1.de    Male
4   5       Raul     Setch             rsetch4@zdnet.com    Male

In [13]:
df.head(3)

   id first_name last_name                         email  gender
0   1   Fidelity    Lincey  flincey0@theglobeandmail.com  Female
1   2      Rheta   Yurasov        ryurasov1@linkedin.com  Female
2   3     Bendix    Paszak             bpaszak2@imdb.com    Male

In [15]:
df.tail()

    id first_name    last_name                         email  gender
15  16    Katrine        Tefft         ktefftf@earthlink.net  Female
16  17  Cleopatra       Deason     cdeasong@surveymonkey.com  Female
17  18       Esra       Struis           estruish@utexas.edu    Male
18  19       Edan      Ordidge     eordidgei@dagondesign.com    Male
19  20      Emili  Leppingwell  eleppingwellj@purevolume.com  Female

In [17]:
df.tail(3)

    id first_name    last_name                         email  gender
17  18       Esra       Struis           estruish@utexas.edu    Male
18  19       Edan      Ordidge     eordidgei@dagondesign.com    Male
19  20      Emili  Leppingwell  eleppingwellj@purevolume.com  Female

In [19]:
type(df)

pandas.core.frame.DataFrame

In [23]:
list(df.columns)

['id', 'first_name', 'last_name', 'email', 'gender']

In [25]:
df['first_name']

0      Fidelity
1         Rheta
2        Bendix
3           Cly
4          Raul
5         Jabez
6        Cybill
7      Celestyn
8       Dierdre
9       Georges
10        Eydie
11       Gerrie
12       Renaud
13        Berry
14        Pammy
15      Katrine
16    Cleopatra
17         Esra
18         Edan
19        Emili
Name: first_name, dtype: object

In [27]:
df['gender']

0     Female
1     Female
2       Male
3       Male
4       Male
5       Male
6     Female
7     Female
8     Female
9       Male
10    Female
11    Female
12      Male
13    Female
14    Female
15    Female
16    Female
17      Male
18      Male
19    Female
Name: gender, dtype: object

In [33]:
type(df['gender']) # series is equivalent to a list

pandas.core.series.Series

In [35]:
list(df['gender'])

['Female',
 'Female',
 'Male',
 'Male',
 'Male',
 'Male',
 'Female',
 'Female',
 'Female',
 'Male',
 'Female',
 'Female',
 'Male',
 'Female',
 'Female',
 'Female',
 'Female',
 'Male',
 'Male',
 'Female']

In [37]:
df[['gender']]

    gender
0   Female
1   Female
2     Male
3     Male
4     Male
5     Male
6   Female
7   Female
8   Female
9     Male
10  Female
11  Female
12    Male
13  Female
14  Female
15  Female
16  Female
17    Male
18    Male
19  Female

In [39]:
type(df[['gender']])

pandas.core.frame.DataFrame

In [45]:
df[['first_name', 'gender']]

   first_name  gender
0    Fidelity  Female
1       Rheta  Female
2      Bendix    Male
3         Cly    Male
4        Raul    Male
5       Jabez    Male
6      Cybill  Female
7    Celestyn  Female
8     Dierdre  Female
9     Georges    Male
10      Eydie  Female
11     Gerrie  Female
12     Renaud    Male
13      Berry  Female
14      Pammy  Female
15    Katrine  Female
16  Cleopatra  Female
17       Esra    Male
18       Edan    Male
19      Emili  Female

In [49]:
df.dtypes #object here is string

id             int64
first_name    object
last_name     object
email         object
gender        object
dtype: object

In [53]:
df1 = pd.read_excel("sample_data.xls")

In [55]:
type(df1)

pandas.core.frame.DataFrame

In [57]:
df1.dtypes

First Name    object
Last Name     object
Gender        object
Age            int64
Email         object
dtype: object

In [59]:
df1.columns

Index(['First Name', 'Last Name', 'Gender', 'Age', 'Email'], dtype='object')

In [61]:
df1[['First Name', 'Gender']]

   First Name  Gender
0       Chloe  Female
1        Tara  Female
2        Adam    Male
3      Kellan    Male
4        Dale    Male
5     Chelsea  Female
6     Freddie    Male
7        Jack    Male
8        Paul    Male
9      Amelia  Female
10   Adrianna  Female
11     Julian    Male
12      Daisy  Female
13    Valeria  Female
14     Alexia  Female
15    Preston    Male
16      Amber  Female
17     Sydney  Female
18    Jessica  Female
19      Spike    Male

In [65]:
df2 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [67]:
df2.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [77]:
df2.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [71]:
type(df2)

pandas.core.frame.DataFrame

In [73]:
df2['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [75]:
type(df2['Survived'])

pandas.core.series.Series

In [79]:
df2[['Survived', 'Pclass', 'Name']]

     Survived  Pclass                                               Name
0           0       3                            Braund, Mr. Owen Harris
1           1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1       3                             Heikkinen, Miss. Laina
3           1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0       3                           Allen, Mr. William Henry
..        ...     ...                                                ...
886         0       2                              Montvila, Rev. Juozas
887         1       1                       Graham, Miss. Margaret Edith
888         0       3           Johnston, Miss. Catherine Helen "Carrie"
889         1       1                              Behr, Mr. Karl Howell
890         0       3                                Dooley, Mr. Patrick

[891 rows x 3 columns]

In [81]:
df2.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [85]:
url_data = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

In [87]:
type(url_data)

list

In [89]:
len(url_data)

2

In [91]:
df3 = url_data[0]

In [93]:
df3

,Rk,Player,Age,Team,Pos,G,GS,MP,FG,FGA,...,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Trp-Dbl,Awards
0,1.0,James Harden,25.0,HOU,SG,81.0,81.0,2981.0,647.0,1470.0,...,384.0,459.0,565.0,154.0,60.0,321.0,208.0,2217.0,4.0,"MVP-2,AS,NBA1"
1,2.0,Stephen Curry,26.0,GSW,PG,80.0,80.0,2613.0,653.0,1341.0,...,285.0,341.0,619.0,163.0,16.0,249.0,158.0,1900.0,0.0,"MVP-1,AS,NBA1"
2,3.0,Russell Westbrook,26.0,OKC,PG,67.0,67.0,2302.0,627.0,1471.0,...,364.0,488.0,574.0,140.0,14.0,293.0,184.0,1886.0,11.0,"MVP-4,AS,NBA2"
3,4.0,LeBron James,30.0,CLE,SF,69.0,69.0,2493.0,624.0,1279.0,...,365.0,416.0,511.0,109.0,49.0,272.0,135.0,1743.0,2.0,"MVP-3,DPOY-13,AS,NBA1"
4,5.0,Damian Lillard,24.0,POR,PG,82.0,82.0,2925.0,590.0,1360.0,...,329.0,378.0,507.0,97.0,21.0,222.0,164.0,1720.0,0.0,AS
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
647,489.0,Malcolm Lee,24.0,PHI,SG,1.0,0.0,2.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
648,490.0,Kalin Lucas,25.0,MEM,PG,1.0,0.0,6.0,0.0,1.0,...,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,NaN
649,491.0,Ronny Turiaf,32.0,MIN,C,2.0,0.0,19.0,0.0,0.0,...,1.0,1.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
650,492.0,David Wear,24.0,SAC,PF,2.0,0.0,7.0,0.0,2.0,...,0.0,2.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,NaN
651,NaN,League Average,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [95]:
df3.head()

,Rk,Player,Age,Team,Pos,G,GS,MP,FG,FGA,...,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Trp-Dbl,Awards
0,1.0,James Harden,25.0,HOU,SG,81.0,81.0,2981.0,647.0,1470.0,...,384.0,459.0,565.0,154.0,60.0,321.0,208.0,2217.0,4.0,"MVP-2,AS,NBA1"
1,2.0,Stephen Curry,26.0,GSW,PG,80.0,80.0,2613.0,653.0,1341.0,...,285.0,341.0,619.0,163.0,16.0,249.0,158.0,1900.0,0.0,"MVP-1,AS,NBA1"
2,3.0,Russell Westbrook,26.0,OKC,PG,67.0,67.0,2302.0,627.0,1471.0,...,364.0,488.0,574.0,140.0,14.0,293.0,184.0,1886.0,11.0,"MVP-4,AS,NBA2"
3,4.0,LeBron James,30.0,CLE,SF,69.0,69.0,2493.0,624.0,1279.0,...,365.0,416.0,511.0,109.0,49.0,272.0,135.0,1743.0,2.0,"MVP-3,DPOY-13,AS,NBA1"
4,5.0,Damian Lillard,24.0,POR,PG,82.0,82.0,2925.0,590.0,1360.0,...,329.0,378.0,507.0,97.0,21.0,222.0,164.0,1720.0,0.0,AS

In [99]:
df3.tail(3)

,Rk,Player,Age,Team,Pos,G,GS,MP,FG,FGA,...,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Trp-Dbl,Awards
649,491.0,Ronny Turiaf,32.0,MIN,C,2.0,0.0,19.0,0.0,0.0,...,1.0,1.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
650,492.0,David Wear,24.0,SAC,PF,2.0,0.0,7.0,0.0,2.0,...,0.0,2.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,NaN
651,NaN,League Average,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [101]:
df3.columns

Index(['Rk', 'Player', 'Age', 'Team', 'Pos', 'G', 'GS', 'MP', 'FG', 'FGA',
       'FG%', '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA',
       'FT%', 'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS',
       'Trp-Dbl', 'Awards'],
      dtype='object')

In [103]:
df3.dtypes

Rk         float64
Player      object
Age        float64
Team        object
Pos         object
G          float64
GS         float64
MP         float64
FG         float64
FGA        float64
FG%        float64
3P         float64
3PA        float64
3P%        float64
2P         float64
2PA        float64
2P%        float64
eFG%       float64
FT         float64
FTA        float64
FT%        float64
ORB        float64
DRB        float64
TRB        float64
AST        float64
STL        float64
BLK        float64
TOV        float64
PF         float64
PTS        float64
Trp-Dbl    float64
Awards      object
dtype: object

In [105]:
df3[['Pos', 'G', 'GS']]

     Pos     G    GS
0     SG  81.0  81.0
1     PG  80.0  80.0
2     PG  67.0  67.0
3     SF  69.0  69.0
4     PG  82.0  82.0
..   ...   ...   ...
647   SG   1.0   0.0
648   PG   1.0   0.0
649    C   2.0   0.0
650   PF   2.0   0.0
651  NaN   NaN   NaN

[652 rows x 3 columns]

In [109]:
df3.to_csv("players_data.csv", index=False)